#include <stdio.h>

// -----------------------------------------------------------------------------------------------------------------------------------------
// -----------------------------------------------------------------------------------------------------------------------------------------
// 함수들의 선언

// Add 함수 선언
int Add(int a, int b);

// Multi 함수 선언
int Multi(int a, int b);

// ShowCharacterStat 함수 선언
void ShowCharacterStat(float playerHp, float playerMp);

// -----------------------------------------------------------------------------------------------------------------------------------------
// -----------------------------------------------------------------------------------------------------------------------------------------

// main 함수 정의
int main(void)
{
    int x = 5000, y = 4000;
    // Add 함수 호출
    int z = Add(x, y);
    printf("Add(%d, %d) => %d\n", x, y, z);

    // Multi 함수 호출
    // 정의가 없으면 링크 단계에서 오류 발생
    z = Multi(x, y);
    printf("Multi(%d, %d) => %d\n", x, y, z);

    // ShowCharacterStat 함수 호출
    ShowCharacterStat(100.0F, 200.0F);

    return 0;
}

// -----------------------------------------------------------------------------------------------------------------------------------------
// -----------------------------------------------------------------------------------------------------------------------------------------
// 함수들의 정의

// Add 함수 정의
int Add(int a, int b)
{
    int result = a + b;
    return result;
}

// 함수 정의가 없으면 링크 단계에서 링커 오류가 발생한다.
// 아래 주석을 해제하면 오류가 해결된다.

// Multi 함수 정의
//int Multi(int a, int b)
//{
//    int result = a * b; // a * b 를 result 에 저장.
//    return result;      // result 반환.
//}

// 함수 정의는 코드에서 어느 위치에 있어도 상관없다.
// 단, 호출 전에 반드시 선언되어 있어야 한다.
// ShowCharacterStat 함수 정의
void ShowCharacterStat(float playerHp, float playerMp)
{
    printf("Player Stat  ==============\n");
    printf("HP: %f\n", playerHp);
    printf("MP: %f\n", playerMp);
}
